Table of Contents
 Class OpeningCirc
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of circular opening in IDEA StatiCa Detail
[OpenModelClass(typeof(Opening))]
public class OpeningCirc : Opening
Inheritance
object
OpenObject
OpenElementId
Opening
OpeningCirc
Inherited Members
 Opening.Name
 Opening.GeomId
 Opening.MasterComponent
 Opening.MasterPoint
 Opening.InsertPoint
 Opening.Outline
 Opening.Position
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 OpeningCirc()
Constructor
public OpeningCirc()
Properties
 Diameter
Diameter of opening
public double Diameter { get; set; }
Property Value
double
 Edit this page